Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t
Struct for the input data for preview polygon face.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t.nPlanes
The constant size of the Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t.aPlanePoints and Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t.aPlaneNormals arrays.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t.aPlanePoints
The array containing the plane points.

Tekla.Structures.DirectManipulation.Model.Native.dotDMPreviewPolygonFaceInput_t.aPlaneNormals
The array containing the plane normals.